app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "경제학 원론 팝니다!"], ["content", "책 깨끗합니다 싸게 팔아요!"], ["created_at", "2018-04-29 14:10:20.450281"], ["updated_at", "2018-04-29 14:10:20.450281"]]
---
    def create
        @post=Post.new
        @post.title=params[:post_title]
        @post.content=params[:post_content]
        @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]
---
    def destroy
        @destroy_post=Post.find(params[:post_id])
        @destroy_post.destroy

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 5]]
---
    def edit
        # 이전 내용을 불러오기 위해 id를 받아와야 함
        @edit_post=Post.find(params[:post_id])

INSERT INTO "comments" ("post_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 1], ["content", "저 살래요!"], ["created_at", "2018-04-29 14:18:18.288881"], ["updated_at", "2018-04-29 14:18:18.288881"]]
---
    def commentcreate

        comment = Comment.new
        comment.post_id = params[:post_id_for_you]
        comment.content = params[:content]
        comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT 1  [["post_id", 2], ["id", 3]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
---
    def commentdestroy
        comment = Post.find(params[:post_id]).comments.find(params[:comment_id])
        comment.destroy

SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT 1  [["post_id", 2], ["id", 8]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
---
    def commentedit
        @edit_comment = Post.find(params[:post_id]).comments.find(params[:comment_id])

SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT 1  [["post_id", 2], ["id", 8]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "comments" SET "content" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["content", "보보"], ["updated_at", "2018-04-30 02:34:03.105713"], ["id", 8]]
---
    def commentupdate
        update_comment = Post.find(params[:post_id]).comments.find(params[:comment_id])
        update_comment.content = params[:comment_content]
        update_comment.save

SELECT  "hashtags".* FROM "hashtags" WHERE "hashtags"."name" = ? LIMIT 1  [["name", "해시태그"]]
INSERT INTO "hashtags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "해시태그"], ["created_at", "2018-05-03 11:54:46.343812"], ["updated_at", "2018-05-03 11:54:46.343812"]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
    def hashtagcreate
        @hashtag = Hashtag.find_by_name(params[:hashtag])

        if @hashtag== nil
            @hashtag = Hashtag.new
            @hashtag.name = params[:hashtag]
            @hashtag.save
        end

        @post = Post.find(params[:post_id])

SELECT "posts".* FROM "posts" WHERE (name LIKE '%ㅇㄴ%' or description LIKE '%ㅇㄴ%' or short_description LIKE '%ㅇㄴ%')
---
  def search

    @q= "%#{params[:query]}%"
    @projects=Post.where("title LIKE ? or content LIKE ?", @q, @q)